# <font color='blue'>Pandas Cheatsheet</font>

Table of content

<ol>
<a href='#1'>1. Pandas Basics</a><BR>
<a href='#2'>2. Basics with DataFrames</a><BR>
<ol>
<a href='#2.1'>2.1 Create a DataFrame from a Dictionary</a><BR>
<a href='#2.2'>2.2 Now download it as an Excel file ;)</a><BR>
<a href='#2.3'>2.3 Collecting the information of a DataFrame.</a><BR>
<a href='#2.4'>2.4 Column Selection</a><BR>
<a href='#2.5'>2.5 Both Row and Column Selection</a><prev><BR>
</ol>
<a href='#3'>3. Select Missing Values</a><BR>
<a href='#4'>4. Composite Selection</a><BR>
<a href='#5'>5. Change Specific Value in the DataFrame</a><BR>
<a href='#6'>6. Sum values in a column with SUM()</a><BR>
<a href='#7'>7. Calculate the mean in a column with MEAN()</a><BR>
<a href='#8'>8. Add a row</a><BR>
    <ol>
    <a href='#8.1'>8.1 Easy method to append one row defining a new row</a><BR>
    <a href='#8.2'>8.2 Complex method to append one row with APPEND()</a><BR>
    </ol>
<a href='#9'>9. Delete a row using DROP()</a><BR>
<a href='#10'>10. Counting the Quantity of Different Values in a Column with VALUE_COUNTS()</a><BR>
<a href='#11'>11. Counting values of all columns with COUNT()</a><BR>
<a href='#12'>12. Sorting Values in a Column Ascending or Descending order with SORT_VALUES()</a><BR>
<a href='#13'>13. Replacing Values in a Column with two values with REPLACE()</a><BR>
<a href='#14'>14. Pivot Table Using Pandas GROUPBY()</a><BR>
<a href='#15'>15. Move values of one column up or down with SHIFT()</a><BR>
</ol>

<a id='1'></a>
### <font color='blue'>1. Pandas Basics</font>

Get to know which version of Pandas you have installed

In [ ]:
import pandas as pd
pd.__version__

See all packages you have installed

In [ ]:
!pip list

See which libraries are required by Pandas to work

In [ ]:
!pip show pandas

<a id='2'></a>
### <font color='blue'>2. Basics with DataFrames</font>

A DataFrame is a Pandas object.

<a id='2.1'></a>
<font color='blue'>**2.1 Create a DataFrame from a Dictionary**</font>

In [ ]:
'''Numpy is needed as there are data with null value'''
import numpy as np

data = {'animal': ['cat', 'cat', 'snake', 'dog','dog','cat','snake','cat','dog','dog' ],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1 , 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes','no','yes','no','no','no','yes', 'no','no']
        }

In [ ]:
labels = ['a', 'b','c','d','e','f','g','h','i','j']

<img src="DataFrame.png" alt="Drawing" style="width: 800px;"/>

Create a DataFrame called `df` from `data` and `labels`

In [ ]:
df = pd.DataFrame(data, index=labels)
df

There you go! It is created. You just did it :)

<a id='2.2'></a>
<font color='blue'>**2.2 Now download it as an Excel file ;)**</font>

In [ ]:
df.to_csv('DataFrame.csv', index=True)

<a id='2.3'></a>
<font color='blue'>**2.3 Collecting the information of a DataFrame. **</font>
1. Type of Pandas Object 
2. Quantity of indexes or rows and their names from where to where. 
3. Quantity of columns. 
4. For each column, the quantity of elements exist as non-null and which type.
5. Summary of the types
6. How much memory this DataFrame occupies

In [ ]:
df.info()

<a id='2.4'></a>
<font color='blue'>**2.4 Row Selection**</font>

In [ ]:
df[0:3]   # <- Selecting the first 3 rows

**Using the function Loc**  
The Loc function works with String.  
*see that loc function work with brackets, not with parenthesis!

In [ ]:
df.loc['a']

**Using the iloc function**  
The iloc function calls for a integer. If provided a string it won't work.

In [ ]:
df.iloc[0]

<a id='2.4'></a>
<font color='blue'>**2.4 Column Selection**</font>

In [ ]:
df['animal']  ## <- include the name of the column

**Using the function iloc**  
This function will use the numbers in the column.  
*Remember to put two brackets when calling a column.

In [ ]:
df.iloc[[0,1]]

**Using the function loc**  
Basically it works looking at the [rows,columns] style.

In [ ]:
df.loc[:,'animal']

In [ ]:
df.loc[:,['animal','age']]

<a id='2.5'></a>
<font color='blue'>**2.5 Both Row and Column Selection**</font>

In [ ]:
df.iloc[[1,2],[0,3]]

<a id='3'></a>
### <font color='blue'> 3. Select Missing Values </font>

In [ ]:
df.loc[df['age'].isnull()]

<a id='4'></a>
### <font color='blue'> 4. Composite Selection </font>

In [ ]:
df.loc[(df['animal']=='cat')&(df['age']<3)]

In [ ]:
df.loc[(df['age']>=2)&(df['age']<=4)]

<a id='5'></a>
### <font color='blue'>5. Change Specific Value in the DataFrame  </font>
It follows the [row, column] nomenclature to call a specific value in the DataFrame

In [ ]:
df.loc['f','age']=1.5
df

<a id='6'></a>
### <font color='blue'> 6. Sum values in a column with SUM()</font>

In [ ]:
df['visits'].sum()

<a id='7'></a>
### <font color='blue'> 7. Calculate the mean in a column with MEAN() </font>

In [ ]:
df['age'].mean()

<a id='8'></a>
### <font color='blue'> 8. Add a row </font>

<a id='8.1'></a>
**8.1 Easy method to append one row defining a new row**

In [152]:
df.loc['k']=['parrot',3,1,'no'] ##<- 'k' is the new label

In [153]:
df

   animal  age  visits priority
a     cat  2.5       1      yes
b     cat  3.0       3      yes
c   snake  0.5       2       no
d     dog  NaN       3      yes
e     dog  5.0       2       no
f     cat  2.0       3       no
g   snake  4.5       1       no
h     cat  NaN       1      yes
i     dog  7.0       2       no
j     dog  3.0       1       no
k  parrot  3.0       1       no

<a id='8.2'></a>
**8.2 Complex method to append one row with APPEND()**

In [158]:
df2 = pd.DataFrame(data={'animal':['parrot'], 'age':[3], 'visits':[1], 'priority':['no']}, index=['k'])
df2

   animal  age  visits priority
k  parrot    3       1       no

In [159]:
df = df.append(df2,sort=False)
df

#make sure to redo df = df.append(df2) because otherwise python pandas will create a different object.

   animal  age  visits priority
a     cat  2.5       1      yes
b     cat  3.0       3      yes
c   snake  0.5       2       no
d     dog  NaN       3      yes
e     dog  5.0       2       no
f     cat  2.0       3       no
g   snake  4.5       1       no
h     cat  NaN       1      yes
i     dog  7.0       2       no
j     dog  3.0       1       no
k  parrot  3.0       1       no

<a id='9'></a>
### <font color='blue'>9. Delete a row using DROP()</font>

In [160]:
df.drop('k', inplace=True)
df
## inplace=True is for it to show it right away

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

<a id='10'></a>
### <font color='blue'> 10. Counting the Quantity of Different Values in a Column with VALUE_COUNTS()</font>

In [161]:
df['animal'].value_counts()

dog      4
cat      4
snake    2
Name: animal, dtype: int64

<a id='11'></a>
### <font color='blue'> 11. Counting values of all columns with COUNT()</font>

In [162]:
df.count()

animal      10
age          8
visits      10
priority    10
dtype: int64

<a id='12'></a>
### <font color='blue'>12. Sorting Values in a Column Ascending or Descending order with SORT_VALUES()</font>

In [163]:
df.sort_values('age',ascending=False)

  animal  age  visits priority
i    dog  7.0       2       no
e    dog  5.0       2       no
g  snake  4.5       1       no
b    cat  3.0       3      yes
j    dog  3.0       1       no
a    cat  2.5       1      yes
f    cat  2.0       3       no
c  snake  0.5       2       no
d    dog  NaN       3      yes
h    cat  NaN       1      yes

<a id='13'></a>
### 13. Replacing Values in a Column with two values with REPLACE()

In [164]:
df['priority'].replace(('yes','no'),(True,False),inplace=True)

In [165]:
df

  animal  age  visits  priority
a    cat  2.5       1      True
b    cat  3.0       3      True
c  snake  0.5       2     False
d    dog  NaN       3      True
e    dog  5.0       2     False
f    cat  2.0       3     False
g  snake  4.5       1     False
h    cat  NaN       1      True
i    dog  7.0       2     False
j    dog  3.0       1     False

In [167]:
df['animal'].replace('snake','python',inplace=True)

In [168]:
df

   animal  age  visits  priority
a     cat  2.5       1      True
b     cat  3.0       3      True
c  python  0.5       2     False
d     dog  NaN       3      True
e     dog  5.0       2     False
f     cat  2.0       3     False
g  python  4.5       1     False
h     cat  NaN       1      True
i     dog  7.0       2     False
j     dog  3.0       1     False

<a id='14'></a>
### 14. Pivot Table Using Pandas GROUPBY()

In [169]:
df.groupby(['animal','visits'])['age'].mean()

animal  visits
cat     1         2.5
        3         2.5
dog     1         3.0
        2         6.0
        3         NaN
python  1         4.5
        2         0.5
Name: age, dtype: float64

In [170]:
grouped_df = df.groupby(['animal','visits'])

for key, item in grouped_df:
    print(grouped_df.get_group(key), "\n\n")

  animal  age  visits  priority
a    cat  2.5       1      True
h    cat  NaN       1      True


  animal  age  visits  priority
b    cat  3.0       3      True
f    cat  2.0       3     False


  animal  age  visits  priority
j    dog  3.0       1     False


  animal  age  visits  priority
e    dog  5.0       2     False
i    dog  7.0       2     False


  animal  age  visits  priority
d    dog  NaN       3      True


   animal  age  visits  priority
g  python  4.5       1     False


   animal  age  visits  priority
c  python  0.5       2     False

<a id='15'></a>
### <font color='blue'>15. Move values of one column up or down with SHIFT()</font>

In [176]:
df = pd.DataFrame({'A':[1,2,2,3,4,5,5,5,6,7,7]})
df

    A
0   1
1   2
2   2
3   3
4   4
5   5
6   5
7   5
8   6
9   7
10  7

In [178]:
df1 = df.shift(-1)
df1

      A
0   2.0
1   2.0
2   3.0
3   4.0
4   5.0
5   5.0
6   5.0
7   6.0
8   7.0
9   7.0
10  NaN

In [175]:
df[df['A']!=df.shift(+1)['A']]

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7